pham-tuan-binh/watcher-koi/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_BSP_LCD_DEFAULT_BRIGHTNESS=0
CONFIG_ESPTOOLPY_BAUD_921600B=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM=y

CONFIG_MOCHI_DEEP_SLEEP_TIMEOUT_SEC=60

# Dynamic frequency scaling: 240 MHz while a task runs, 80 MHz when idle.
# Light sleep stays off; the knob and touch polling would defeat it.
# For power measurements add CONFIG_PM_PROFILING=y and
# CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y (with
# CONFIG_FREERTOS_USE_TRACE_FACILITY=y and
# CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y): the frame log then
# carries time at each clock and per task.
CONFIG_PM_ENABLE=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LVGL_PORT_TASK_AFFINITY_CPU1=y
CONFIG_LVGL_DRAW_BUFF_HEIGHT=412
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
